Show / Hide Table of Contents
Class TendonDuct
Tendon duct
Inheritance
System.Object
OpenObject
TendonDuct
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.CrossSection
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Services.Concrete.ReinforcedSection.TendonDuct,CI.ReinforcedSection")]
public class TendonDuct : OpenObject
Properties
Improve this Doc   View Source
Diameter
Diameter
Declaration
public double Diameter { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Id
Tendon duct Id
Declaration
public int Id { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
IsDebondingTube
rue for debonding tubes, false for tendon ducts
Declaration
public bool IsDebondingTube { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
MaterialDuct
Tendon duct material
Declaration
public MaterialDuct MaterialDuct { get; set; }
Property Value
 Type |  Description
 MaterialDuct
Improve this Doc   View Source
Point
Position of duct
Declaration
[OpenModelProperty("CentrePoint")]
public Point2D Point { get; set; }
Property Value
 Type |  Description
 Point2D
 Improve this Doc
 View Source